; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	spectrograph4 - mode
	infrared3 - mode
	image1 - mode
	thermograph2 - mode
	Star2 - direction
	Star5 - direction
	GroundStation11 - direction
	GroundStation13 - direction
	GroundStation1 - direction
	Star9 - direction
	GroundStation8 - direction
	Star4 - direction
	Star0 - direction
	Star3 - direction
	GroundStation7 - direction
	Star12 - direction
	GroundStation10 - direction
	Star6 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star12)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star12)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
)
(:goal (and
	(have_image Planet14 image1)
	(have_image Planet15 infrared3)
	(have_image Phenomenon16 image1)
	(have_image Star17 thermograph2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 4
2. (turn_to satellite1 phenomenon16 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 4
3. (turn_to satellite1 star6 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star6)
   goals met: 0 of 4
4. (calibrate satellite1 instrument3 star6)
   added: (calibrated instrument3)
   goals met: 0 of 4
5. (turn_to satellite1 phenomenon16 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 4
6. (take_image satellite1 phenomenon16 instrument3 image1)
   added: (have_image phenomenon16 image1)
   goals met: 1 of 4
7. (turn_to satellite1 planet14 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet14)
   goals met: 1 of 4
8. (take_image satellite1 planet14 instrument3 image1)
   added: (have_image planet14 image1)
   goals met: 2 of 4
9. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 2 of 4
10. (take_image satellite1 planet15 instrument3 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 3 of 4
11. (turn_to satellite1 star17 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star17)
   goals met: 3 of 4
12. (take_image satellite1 star17 instrument3 thermograph2)
   added: (have_image star17 thermograph2)
   goals met: 4 of 4
